In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
#Create a Dataframe from clipboard
age_df = pd.read_clipboard()
print(age_df)

  First name    Last name   Age
0       Tinu     Elejogun    14
1     Javier       Zapata    28
2       Lily    McGarrett    18
3  Olatunkbo     Chijiaku    22
4   Adrienne     Anthoula    22
5     Axelia   Athanasios    22
6  Jon-Kabat         Zinn    22
7    Thabang        Mosoa    15
8      Rhian        Ellis    12

In [6]:
#Display column names
age_df.columns

Index(['First name ', 'Last name ', 'Age'], dtype='object')

In [7]:
#Access one or more columns
print(age_df)

  First name    Last name   Age
0       Tinu     Elejogun    14
1     Javier       Zapata    28
2       Lily    McGarrett    18
3  Olatunkbo     Chijiaku    22
4   Adrienne     Anthoula    22
5     Axelia   Athanasios    22
6  Jon-Kabat         Zinn    22
7    Thabang        Mosoa    15
8      Rhian        Ellis    12

In [8]:
age_df[['First name ', 'Age']]

  First name   Age
0       Tinu    14
1     Javier    28
2       Lily    18
3  Olatunkbo    22
4   Adrienne    22
5     Axelia    22
6  Jon-Kabat    22
7    Thabang    15
8      Rhian    12

In [64]:
#WHat is a NAN value - assigning a null value to a column if it has nothing
age_df['rank'] = np.nan
print(age_df)

  First name    Last name   Age  rank
0       Tinu     Elejogun    14   NaN
1     Javier       Zapata    28   NaN
2       Lily    McGarrett    18   NaN
3  Olatunkbo     Chijiaku    22   NaN
4   Adrienne     Anthoula    22   NaN
5     Axelia   Athanasios    22   NaN
6  Jon-Kabat         Zinn    22   NaN
7    Thabang        Mosoa    15   NaN
8      Rhian        Ellis    12   NaN

In [9]:
#Using head and tail functions
age_df.head()

  First name   Last name   Age
0       Tinu    Elejogun    14
1     Javier      Zapata    28
2       Lily   McGarrett    18
3  Olatunkbo    Chijiaku    22
4   Adrienne    Anthoula    22

In [10]:
age_df.tail()

  First name    Last name   Age
4   Adrienne     Anthoula    22
5     Axelia   Athanasios    22
6  Jon-Kabat         Zinn    22
7    Thabang        Mosoa    15
8      Rhian        Ellis    12

In [12]:
#Assign values to a dataframe using 1. numpy 2. Series
array_1 = np.arange(9)
print(array_1)

[0 1 2 3 4 5 6 7 8]

In [13]:
age_df['rank']=array_1

In [14]:
print(age_df)

  First name    Last name   Age  rank
0       Tinu     Elejogun    14     0
1     Javier       Zapata    28     1
2       Lily    McGarrett    18     2
3  Olatunkbo     Chijiaku    22     3
4   Adrienne     Anthoula    22     4
5     Axelia   Athanasios    22     5
6  Jon-Kabat         Zinn    22     6
7    Thabang        Mosoa    15     7
8      Rhian        Ellis    12     8

In [15]:
#Using series
newrank_series = Series([10,11,12],index=[3,5,6])
age_df['rank'] = newrank_series

In [16]:
print(age_df)

  First name    Last name   Age  rank
0       Tinu     Elejogun    14   NaN
1     Javier       Zapata    28   NaN
2       Lily    McGarrett    18   NaN
3  Olatunkbo     Chijiaku    22  10.0
4   Adrienne     Anthoula    22   NaN
5     Axelia   Athanasios    22  11.0
6  Jon-Kabat         Zinn    22  12.0
7    Thabang        Mosoa    15   NaN
8      Rhian        Ellis    12   NaN

In [18]:
#Delete a column
del(age_df['Last name '])

In [19]:
print(age_df)

  First name   Age  rank
0       Tinu    14   NaN
1     Javier    28   NaN
2       Lily    18   NaN
3  Olatunkbo    22  10.0
4   Adrienne    22   NaN
5     Axelia    22  11.0
6  Jon-Kabat    22  12.0
7    Thabang    15   NaN
8      Rhian    12   NaN

In [21]:
#Convert a dictionary into a dataframe
sample_dict = {
    'company': ['Nestle' , 'PG'],
    'profit' : [1000,500]
}
print(sample_dict)

{'company': ['Nestle', 'PG'], 'profit': [1000, 500]}

In [22]:
sample_df = DataFrame(sample_dict)
print(sample_df)

  company  profit
0  Nestle    1000
1      PG     500